[{"url": "https://realtylink.org/en/townhouse~for-rent~knight-vancouver/262880211?view=Summary", "title": "Townhouse for rent", "region": "3981 Fleming Street", "address": "Knight, Vancouver", "description": "Brand new Format by Cressey townhouse! 3 bed 2.5 bath, 1747 sq ft over 3 levels. Features A/C, stacked washer and dryer, 2 parking included (1 of which is EV ready). Kitchen includes fridge, stove,oven, dishwasher and microwave. Private storage room and additional EV parking available for additional fees. Walk to Trout Lake, T&T, cafes, restaurants and schools. School catchment: K-7 Lord Selkirk Elementary, 8-12 Gladstone Secondary. No smoking, no vaping please, no roommate share rental. Pets allowed upon approval. Please contact Jason for viewings and inquiries.", "rooms": {"bathrooms": 3, "bedrooms": 3}, "area": "1,747 sqft", "price": "$5,300 /month", "images": null}, {"url": "https://realtylink.org/en/apartment~for-rent~marpole-vancouver/262891502?view=Summary", "title": "Apartment for rent", "region": "2702 455 Sw Marine Drive", "address": "Marpole, Vancouver", "description": "1 Bedrooms plus den, 500 sqft Interior Space + Balcony Space. SOUTH Exposure. Built in 2019. Central Heating. Central Air Conditioner. In-suite Washer/Dryer. 1 Additional Storage included. Unfurnished. Laminate at living area + bedroom floors. 1 Parking included. Very close to Canada Line, Bus Terminal, shopping & T&T market. Built by Concord Pacific.", "rooms": {"bathrooms": 1, "bedrooms": 1}, "area": "500 sqft", "price": "$2,400 /month", "images": null}, {"url": "https://realtylink.org/en/apartment~for-rent~collingwood-ve-vancouver/262897583?view=Summary", "title": "Apartment for rent", "region": "1603 5470 Ormidale Street", "address": "Collingwood VE, Vancouver", "description": "Welcome to Wall Centre Central Park Tower 3 in the Heart of Vancouver. This unit features floor-to-ceiling windows, wood & modern wool carpet flooring, soft close shaker style cabinetry, S/S appliances. Conveniently located within walking distance to Joyce Skytrain Station, Bus Stops, and Close to Hwy 1 ( Easy access to Burnaby, Coquitlam, and Vancouver Downtown), Shopping mall (Metrotown), Markets, Restaurants and Cafes, and Many More. Absolute Gem! Amenities include Building Manager, Gym, Elevator, Playground, In-Suite Laundry. This 1 Bed + 1 Bath + Den unit with a living space of 540 Sq ft is your ultimate dream home.", "rooms": {"bathrooms": 1, "bedrooms": 1}, "area": "540 sqft", "price": "$2,500 /month", "images": null}, {"url": "https://realtylink.org/en/apartment~for-rent~yaletown-vancouver/262891298?view=Summary", "title": "Apartment for rent", "region": "602 1501 Howe", "address": "Yaletown, Vancouver", "description": "Rarely available huge Luxury 888 Beach Ocean Tower ~1650 sf beautifully renovated unit with concierge. Centrally located on the seawall w/ direct waterfront views. This Southeast corner home with immaculate interior featuring natural oak, wide plank hardwood floors throughout. Travertine faced gas fireplace with custom millwork and motorized roller blinds. The master bedroom with gorgeous seaside views and customized walk-through wardrobe. Ensuite bath clad in marble tiles and large walk-in steam shower and heated floors. The kitchen is furnished with lacquer and natural walnut cabinetry. Two islands with wetbar. Caesar stone counters and high-end appliances. Tranquil seawall living with shops and restaurants within walking distance (Vancouver’s Beach District). Includes 2 parking and 1 st", "rooms": {"bathrooms": 2, "bedrooms": 2}, "area": "1,649 sqft", "price": "$7,000 /month", "images": null}, {"url": "https://realtylink.org/en/apartment~for-rent~kitsilano-vancouver/262854766?view=Summary", "title": "Apartment for rent", "region": "202 1985 W 8th Avenue", "address": "Kitsilano, Vancouver", "description": "No description", "rooms": {"bathrooms": 1, "bedrooms": 1}, "area": "475 sqft", "price": "$2,750 /month", "images": null}]